src/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def current_user
      if !session[:user_id].to_s.strip.empty?
        existing_user = User.find_by(id: session[:user_id])