src/app/controllers/comments_controller.rb

  def create
    p 'COMMENT'
    p @comment
    if session[:user_id] != nil
      Comment.create({user_id: session[:user_id], picture_id: @comment.picture_id, message: params[:comment]['message']})
---
INSERT INTO "comments" ("user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["message", "Nice one "], ["created_at", "2021-01-31 17:32:53.227740"], ["updated_at", "2021-01-31 17:32:53.227740"]]