src/app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("image_text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image_text", "New picture"], ["created_at", "2021-01-31 16:17:44.951111"], ["updated_at", "2021-01-31 16:17:44.951111"]]
---
  def new
    @picture = Picture.new
    sql = "SELECT pictures.*, users.username,
            c.message, c.username as username_comment
            FROM pictures
            INNER JOIN users
            ON pictures.user_id = users.id
            LEFT JOIN (
              SELECT comments.picture_id, comments.message, users.username
              FROM comments
              INNER JOIN users
              ON comments.user_id = users.id
            ) AS c
            ON c.picture_id = pictures.id
            ORDER BY pictures.created_at DESC"

INSERT INTO "pictures" ("user_id", "image_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["image_text", "testing picture"], ["created_at", "2021-01-31 16:25:21.549075"], ["updated_at", "2021-01-31 16:25:21.549075"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    if session[:user_id] != nil
      @picture = Picture.create({user_id: session[:user_id], image_text: params[:picture]['image_text']})
      @user = User.find(session[:user_id])