src/app/controllers/users_controller.rb

  def create
    @existing_user = User.find_by_email(params[:user]['email'])
    if @existing_user.nil?
        @user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fgolp@co.uk"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "heylo"], ["email", "fgolp@co.uk"], ["password_digest", "$2a$12$pq71csG3jje5/eyPJ0M/d.un8hgK0/VjxBnaDO6hOnI3XALMWyv8."]]