app/views/users/show.html.haml

SELECT  1 AS one FROM "photos" WHERE "photos"."user_id" = $1 LIMIT 1  [["user_id", 2]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 2]]
---

- if @user.photos.any?

SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 3]]
---
      = link_to "like", photo_likes_path(photo), class: 'likes-link'
      %span.likes_count= photo.likes.count

SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 1]]
---
      = photo.name
    - if photo.comments.any?