inztagram/app/controllers/application_controller.rb

  def set_current_user
    if session[:user_id]
      Current.user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]