inztagram/app/controllers/inztagram_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def index
    # flash[:notice] = "Logged in successfully"
    # flash[:alert] = "Invalid email or password"
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])