app/views/photos/index.html.haml

                = link_to "like", photo_likes_path(photo), class: 'likes-link'
                %span.likes_count= photo.likes.count
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 1]]

                .comments__individual
                  - if photo.comments.any?
---
SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 2]]