app/views/photos/index.html.erb


      <% user = User.find(photo.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

      <div class="like_count">
        <%= photo.count_likes %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 1]]

      <div class="comments">
        <% comments = Comment.where("photo_id = #{photo.id}") %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 1]]