app/views/photos/show.html.haml

SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 2]]
---

- if photo.comments.any?