app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    <div id=<%= "post_#{i}" %>>
      <h2><%= User.find(post.user_id).username %></h2>