app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("thoughts", "user_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thoughts", "nice!!"], ["user_id", 1], ["photo_id", 4], ["created_at", "2015-07-26 00:15:08.127135"], ["updated_at", "2015-07-26 00:15:08.127135"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create_with_user(comment_params, current_user)