app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]
---
  def create
    photo = Photo.find(params[:photo_id])