app/controllers/homepage_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def index
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])