app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user_avatar(id)
    User.find(id).avatar