app/controllers/likes_controller.rb

  def create
    @like = Like.new(like_params)

    puts back_to

    respond_to do |format|
      if @like.save
---
INSERT INTO "likes" ("like", "user_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["like", ""], ["user_id", 3], ["photo_id", 11], ["created_at", "2015-09-07 17:54:03.616484"], ["updated_at", "2015-09-07 17:54:03.616484"]]