app/controllers/photos_controller.rb

  def create
    @photo = current_user.photos.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("description", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Hello"], ["picture", ""], ["user_id", 1], ["created_at", "2015-09-05 21:12:15.615390"], ["updated_at", "2015-09-05 21:12:15.615390"]]

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 3]]

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]