app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new post"], ["link", "http://i.imgur.com/0tJPjzf.jpg"], ["user_id", 1], ["created_at", "2017-07-30 18:55:56.090107"], ["updated_at", "2017-07-30 18:55:56.090107"]]

  def destroy
    @post = current_user.posts.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 358]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 358]]

  def update
    @post = Post.find(params[:id])
    @post.update(caption: params[:caption])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 160]]
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "Wrong photo, with typos in caption!"], ["updated_at", "2015-09-06 17:51:28.607127"], ["id", 160]]